Revit 2020 API
MEPModel.ElectricalSystems Property
Retrieves the electrical systems that are currently created using this MEPModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public ElectricalSystemSet ElectricalSystems { get; }
Visual Basic
Public ReadOnly Property ElectricalSystems As ElectricalSystemSet
	Get
Visual C++
public:
property ElectricalSystemSet^ ElectricalSystems {
	ElectricalSystemSet^ get ();
}
Remarks
This property returns a set of Electrical Systems. If there are no electrical systems created for this model, this property will be an empty set.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace